[
  {
    "company": "HubSpot",
    "role": "Business Deveopment Representative",
    "resps": [
      "Prospect and engage potential customers through strategic outbound campaigns using HubSpot Sales Hub, maintaining 100+ daily touchpoints across email, phone, and LinkedIn, resulting in consistent pipeline generation and meeting quota attainment.",
      "Research and qualify target accounts using tools like ZoomInfo and LinkedIn Sales Navigator, ensuring alignment with ideal customer profile (ICP).",
      "Collaborate with Account Executives to refine sales strategies and improve lead handoff processes.",
      "Develop and optimize personalized outreach templates and cadences."
    ],
    "date": "Feb 2025 - Present"
  },
  {
    "company": "TSP Consulting Services, Inc.",
    "role": "Frontend Developer",
    "resps": [
      "Develop responsive and interactive user interfaces for complex banking applications using React and TypeScript, resulting in an increase in user engagement and a reduction in customer support tickets related to UI issues.",
      "Utilized Mock Service Worker for robust frontend testing, improving application reliability and reducing development cycle time.",
      "Collaborated with cross-functional teams to implement new features and improve existing functionality, contributing to an increase in overall product satisfaction scores.",
      "Contributed to the development of reusable component libraries, leveraging Material-UI and custom design components, which accelerated project timelines and improved code consistency across the team."
    ],
    "date": "April 2024 - Jan 2025"
  },
  {
    "company": "Frontend Simplified",
    "role": "Customer Success Mentor",
    "resps": [
      "Lead weekly workshops on emerging frontend technologies and conduct biweekly comprehensive code reviews, resulting in improvement in student project quality.",
      "Manage student progress using project management tools, facilitating regular 1:1 meetings via Calendly to ensure accountability, leading to an increase in course completion rates.",
      "Collaborate with career services to evaluate student readiness for job market entry, contributing to an increase in job placement rates.",
      "Implement and maintain a structured check-in system to monitor overall student development, proactively addressing challenges and reducing dropout rates."
    ],
    "date": "June 2024 - Dec 2024"
  }
]
